# Homebrew taps
tap "dopplerhq/cli"
tap "fluxcd/tap"
tap "heroku/brew"

# Core development tools
brew "git"
brew "neovim"
brew "tmux"
brew "tmuxinator"
brew "asdf"
brew "direnv"

# Modern CLI replacements
brew "ripgrep"        # Better grep
brew "fd"             # Better find
brew "bat"            # Better cat
brew "eza"            # Better ls
brew "zoxide"         # Smart cd
brew "fzf"            # Fuzzy finder
brew "starship"       # Modern prompt

# Essential utilities
brew "jq"             # JSON processor
brew "yq"             # YAML processor
brew "htop"           # Process monitor
brew "watch"          # Command repetition
brew "wget"
brew "curl"
brew "tree"
brew "gnupg"

# Development databases
brew "postgresql@15", restart_service: true
brew "redis", restart_service: true
brew "mysql", restart_service: true

# Development utilities
brew "pgcli"          # Better postgres CLI
brew "mycli"          # Better mysql CLI
brew "tig"            # Git repository browser

# Cloud & DevOps
brew "awscli"
brew "kubectl"
brew "helm"
brew "terraform"
brew "terragrunt"
brew "dopplerhq/cli/doppler"

# Container tools
brew "docker"
brew "docker-compose"
brew "kind"           # Kubernetes in Docker

# Language tooling (languages managed by asdf)
brew "shellcheck"     # Shell script analysis

# Modern shell enhancements
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Networking & security
brew "tmate"          # Terminal sharing
brew "chamber"        # Secrets management

# Flux for GitOps
brew "fluxcd/tap/flux"

# Heroku CLI
brew "heroku/brew/heroku"

# Casks for GUI applications
cask "docker"
cask "iterm2"